#include "bsp.h"

//int calculateTwosComplement(int input) 
//{
//    // 计算输入参数的补码形式的负数
//    int twosComplement = -input;
//    return twosComplement;
//}

///*
//*********************************************************************************************************
//*	函 数 名: AppTaskMotorSppedScanning
//*	功能说明: 电机 速度扫描模式
//*	形    参: 
//*	返 回 值: 无
//*   优 先 级:  
//*********************************************************************************************************
//*/
//void AppTaskMotorSppedScanning(void *argument)
//{
//}




///*
//*********************************************************************************************************
//*	函 数 名: AppTaskUnderMotorSppedScanning
//*	功能说明: 下壁电机 速度扫描模式
//*	形    参: 
//*	返 回 值: 无
//*   优 先 级:  
//*********************************************************************************************************
//*/
//void AppTaskUnderMotorSppedScanning(void *argument)
//{
//}

///*
//*********************************************************************************************************
//*	函 数 名: AppTaskMotorFindZero
//*	功能说明: 电机数据查询任务，轮询发送 CANOPEN 电机参数查询数据
//*	形    参: 
//*	返 回 值: 无
//* 优 先 级:  
//*********************************************************************************************************
//*/
//void AppTaskMotorDataquery(void *argument)
//{	
//}

///*
//*********************************************************************************************************
//*	函 数 名: AppTaskUnderMotorDataquery
//*	功能说明: 下壁电机数据查询任务，轮询发送 CANOPEN 电机参数查询数据
//*	形    参: 
//*	返 回 值: 无
//* 优 先 级:  
//*********************************************************************************************************
//*/
//void AppTaskUnderMotorDataquery(void *argument)
//{
//}


///*
//*********************************************************************************************************
//*	函 数 名: AppTaskMotorSpped
//*	功能说明: 电机速度模式任务,暂时好像用不上，先不写了
//*	形    参: 
//*	返 回 值: 无
//* 优 先 级:  
//*********************************************************************************************************
//*/
//void AppTaskMotorSpped(void *argument)
//{
//}

